coup

ai
natur
continu
ahm
restrict
moral
concern
death
group
algeria
sentenc
1965
bella
41
their
sinc
smuggl
health
prison
peopl
who
june
drug
tat
procur
former
releas
such
ha
effort
overthrown
introduct
also
ben
d
amnesti
undermin
algerian
februari
hi
punish
presid
under
1975
all
angola
individu
within
recogn
soon
repres
press
violent
result
have
need
follow
portug
establish
reimpos
independ
total
number
clash
lead
union
liber
support
three
divis
includ
which
between
new
transit
unita
leader
assist
movement
project
full
led
power
financi
after
agreement
nation
talk
regim
censorship
front
deport
sign
provision
began
11
novemb
these
overthrow
caetano
1974
rehabilit
angolan
fnla
april
portugues
mpla
imprison
popular
januari
polit
took
provid
obtain
held
particularli
human
still
writer
had
littl
communist
he
promin
mention
world
name
tri
term
like
artist
common
where
societi
albania
are
close
out
figur
estim
legat
rite
approach
correct
300
isol
step
believ
refuge
about
island
albanian
outsid
extrem
imposs
frequent
appli
exagger
right
suppli
prove
due
illeg
dure
more
but
berlin
known
line
than
those
banish
religi
east
remain
howev
penal
almost
is
1972
high
seem
197475
sever
corfu
greek
perform
parti
six
detail
1
labour
difficult
fruitless
reach
000
countri
ballsh
practic
exprison
camp
spent
grossli
or
inform
escap
invari
sector
medic
violenc
execut
opposit
offici
lack
legal
victim
deepen
vigilant
concentr
privat
rapid
thank
easi
guerrilla
activ
state
articl
squad
condon
400
argentina
save
sieg
tortur
introduc
men
them
march
wellb
civilian
watch
made
five
failur
increas
now
specif
geograph
secretari
alreadi
martin
found
septemb
wrote
view
prevent
uruguayan
surpass
deal
some
procedur
50
past
urgent
117
latin
maria
lawyer
respons
further
kidnap
dispos
event
special
gross
appear
confirm
avoid
defenc
per
current
written
larg
import
appeal
occurr
method
refer
investig
themselv
august
numer
gener
concem
situat
bodi
although
fulli
come
stricter
both
protect
interven
militari
region
against
keep
american
person
place
act
action
commit
assassin
transcend
among
major
own
extent
certif
into
profession
custodi
one
63
leftw
complex
unit
circumstanti
institut
commun
data
there
maltreat
peac
avail
commission
live
tragic
interest
dissent
letter
call
immedi
500
murder
statement
juli
impress
cloth
urg
accompani
dead
chile
particular
detaine
safeguard
vulner
present
case
counsel
rightw
19
whom
structur
n
nevertheless
unusu
mr
posit
exist
problem
toward
provis
control
claim
later
convey
creat
give
certain
alleg
curb
infring
ennal
border
repeatedli
again
end
no
receiv
constitut
juan
violat
member
other
adequ
condemn
tension
durat
evid
provinci
effect
estela
befor
attent
thi
veri
inquiri
judici
grow
feder
alloc
principl
domingo
secur
seriou
clear
author
1973
detent
polic
declar
potenti
legisl
argentinian
telegram
move
octob
immigr
run
if
would
pindl
two
commut
sent
return
risk
minist
hang
lynden
haiti
haitian
prime
arbitrari
bahama
work
mani
bahrain
seven
depart
khalifa
trade
sheikh
onli
29
research
arrest
sulman
strike
subsequ
bin
ruler
worker
know
unionist
news
apart
issa
adopt
issu
corpu
summer
consider
bihari
affair
over
mujibur
approv
month
four
advisori
subcontin
touch
defend
bail
ground
penalti
25
23
28
2528
should
bahini
board
wellknown
discuss
earli
then
nearli
format
dal
express
judgement
leagu
tribun
rahman
they
affect
1968
judiciari
collabor
disturb
proscrib
list
amend
paramilitari
small
crisi
habea
enci
moudud
84
said
suprem
assum
review
asia
leav
conduct
indefinit
24
awami
previou
whose
met
383
ask
earliest
impos
central
extens
announc
brutal
foreign
precis
trial
enforc
context
chang
guilti
south
pakistan
suspend
final
civil
jatiya
brought
presidenti
opportun
crime
facil
bangladesh
visit
2
armi
war
parliament
regul
form
forc
last
technic
wide
17
possibl
inquir
until
while
limit
can
fundament
prospect
conspiraci
constant
petit
critic
rule
measur
aggrav
disappear
develop
belong
econom
same
detain
flood
emerg
actual
fourth
combin
higher
jsd
regard
baksal
time
await
upon
most
briefli
rais
court
law
charg
recent
accord
reliabl
1971
without
jail
dacca
serious
decemb
order
represent
assur
jigm
sought
deputi
increasingli
home
plot
26
21
bhutan
turkish
tibetan
singy
when
discoveri
3
bhutanes
5
might
public
life
finish
mumtaz
coron
advanc
interrog
delhi
wherea
condit
date
resid
becom
transcript
day
proceed
king
precari
wangchuk
spite
18
could
30
well
face
committe
learn
observ
came
soysal
recess
partial
help
jurisdict
exil
celebr
mission
bring
protest
previous
despit
accus
27
cochabamba
aria
father
persuad
prolong
program
persist
banzer
main
easter
vigor
sourc
food
de
intem
organ
administr
suarez
summarili
peasant
allegedli
either
ban
cessat
manag
expel
up
consequ
cost
victor
miner
decre
repress
priest
stockholm
superior
subvers
bolivian
base
undu
address
put
post
afterward
basi
justic
freedom
literatur
refus
moni
memorandum
incommunicado
defeat
improv
ostens
carri
period
64
famili
ensur
throughout
given
nomin
lennart
system
long
lopez
physic
rehabl
taken
bolivia
belgian
citizen
coordin
hear
togeth
albeit
valley
target
hour
servic
judg
sweden
delay
aid
money
circul
expir
eric
denial
welcom
anoth
travel
hugo
write
compet
take
interior
document
expens
price
compulsori
grave
task
attempt
preced
shortli
relief
left
consid
approxim
africa
ani
formerli
barm
botswana
involv
statu
forcibl
convent
suggest
young
black
repatri
scheme
rhodesian
secretariat
afford
vividli
student
dube
abduct
demonstr
zapu
francistown
zimbabw
35
deni
contact
african
refug
latest
compromis
pardon
useof
illustr
gradual
focus
inaugur
40
unoffici
alv
fear
find
strongli
parliamentari
locat
210
22
polici
hunger
raid
rosa
quiroz
him
surpris
becam
estabush
senat
hope
gave
confront
variou
janeiro
bid
grand
govem
promis
ernesto
appar
exact
fled
rumour
down
ilha
victori
success
seixa
da
l
necessari
integr
democratico
ivan
husband
18month
cabl
mdb
back
imposit
francisco
connect
pariiamentari
our
cesar
commiss
difficuh
es
brazil
expert
marcio
section
cassado
brief
publish
debat
won
rel
print
lui
experi
benjamin
avert
ugart
manipul
geisel
drew
concei
succeed
disput
advertis
interpret
arena
boy
c
miss
slightli
o
motion
roman
instanc
transgress
ministri
prefac
first
origin
elect
campaign
point
scene
son
psychiatr
indict
65
66
church
oppos
bre
open
rossi
silva
symptom
her
movimento
transfer
question
basilio
citi
silenc
brazilian
pohci
submiss
reissu
minor
treatment
sarmiento
reorgan
relax
moreira
fora
relat
ht
al
lift
link
ao
examin
behalf
women
serv
augusto
irregular
hous
remot
prepar
vocal
record
r
friend
absenc
professor
latitud
cathol
sao
ana
am
indic
pubuc
rio
whereabout
hardlin
pinto
seek
archbishop
she
coelho
wilson
cours
oab
juiz
paz
offer
pinochet
paulo
discrep
answer
instead
probabl
pal
singl
updat
draw
armando
142
congress
may
earlier
discov
driven
intent
amongst
wave
center
unexplain
thu
lose
caus
reaction
writ
allow
commonwealth
set
emphasi
directli
revolt
direct
britain
motiv
british
bolkiah
occur
85
lie
decid
waddaulah
equival
49
influenc
descript
1962
offic
way
mend
choos
islam
freed
kingdom
brunei
properli
intend
felt
lobbi
callaghan
realiz
extern
teach
hold
loyalti
comment
parhament
sultan
did
request
responsibihti
will
jame
each
hassan
retain
studi
complet
oath
wrongdo
assembl
citizenship
danger
sofia
ivi
zhivkov
benjoseph
autumn
austria
werner
council
suddenli
austrian
economist
53yearold
dozen
depriv
descent
interfer
top
espionag
15year
heinrich
chemic
staff
vienna
reduc
israel
intellectu
jewish
similar
spetter
bulgarian
nativ
109
recidivist
dissid
kept
dr
industri
nor
wait
town
12
join
i
wish
31
bill
worldwid
justif
doe
twice
solomon
perman
arrang
resettl
todor
biala
say
bulgaria
burma
rang
buddhist
identifi
broke
process
win
funer
martial
kill
887
longstand
culprit
univers
wound
ne
makeshift
u
thant
nu
told
week
riot
rangoon
symbol
adversari
sped
reportedli
70
100
campu
true
widespread
10
whether
seiz
ko
monk
52
recov
nine
troop
night
meet
loot
coffin
mausoleum
cannibalist
cannib
offenc
meanwhil
replac
42
definit
adopte
greet
maximum
companion
repli
burundi
convict
proof
card
ernest
conven
old
ten
show
lon
hard
capit
head
beuef
second
through
cambodian
substanti
arm
phnom
flimsi
repris
area
distinct
concord
royal
sovereign
least
princ
note
funk
matak
norodom
conflict
penh
nol
khmer
midmay
secondhand
clemenc
sihanouk
account
pari
stay
reconcili
class
cambodia
reaffirm
spirit
assess
surrend
tendenc
16
correspond
proclaim
republ
maintain
mass
enter
went
camerounian
j
sando
nkongsamba
jeanrichard
centrafricain
douala
poutic
grant
elsewher
bishop
categori
ahidjo
yaound
tchollir
rale
encourag
maroua
74
untri
du
yoko
popul
b
g
postcard
cameroun
monsignor
cover
upc
ahmad
travailleur
malikanga
rearrest
madam
embassi
moundou
chad
urban
surviv
poor
saw
172
subject
prioriti
what
doba
turn
sara
chadian
fight
displeas
ndjamena
franc
christian
43
fate
handl
comp
hundr
initi
mostli
ethnic
uncertain
coincid
walk
106
conclus
7year
13
38
deterior
32
tombalbay
yondo
matter
princip
die
lenienc
undergo
hfe
interamerican
code
german
80page
reput
vari
middl
ineffect
except
willing
decis
8
eyewit
everi
corrobor
cuba
dina
volum
formal
anyth
57
eve
nacion
achiev
journalist
undertak
oblig
overwhelm
enorm
67
redress
pass
guarante
extract
even
icj
confess
particip
recognit
basic
direcci
jurist
anniversari
liberti
sole
obey
prosecut
never
confer
standard
york
excess
distinguish
addit
chilean
rare
launch
ilo
retent
innumer
prior
renew
social
produc
magistr
render
elementari
prefer
insist
pubucli
68
respect
massiv
48hour
differ
describ
submit
intellig
horst
too
6
reced
impecc
geneva
sharpli
advers
paltri
demand
cumul
nonretroact
salvador
restor
testimoni
air
aim
un
materi
gather
ad
mexico
unjust
accept
virtu
agenc
entireti
hoc
48
etc
personnel
sixmonth
actor
junta
allend
reject
unless
attend
normal
investigaci
southern
undertaken
swiftli
associ
redefin
doctor
affidavit
so
worst
academ
soviet
conjunct
han
cauca
provinc
rural
alfonso
colombia
69
michelsen
local
featur
oppon
longterm
mcgovern
america
democrat
graduat
satisfactori
pressur
mayjun
castro
guid
belief
inger
deleg
convers
20
inde
explain
1967
1960
compos
georg
access
evolv
algier
interview
progress
occup
7580
indisput
predominantli
adher
around
fidel
domest
object
circumst
intens
plan
solv
depend
decreas
educ
requir
possess
physician
cuban
15
enabl
valuabl
manual
fahland
yield
revolutionari
part
privileg
make
radio
mean
cypriot
denktash
welldocu
ecevit
sailor
london
110
turkey
ehrenstral
how
reconsid
4
electr
eventu
prisonersofwar
detat
abolit
vendetta
clerid
trace
sadi
hotel
lawless
dome
makario
bulent
fall
stage
costa
land
utmost
cypru
400500
irmak
shock
rauf
mainland
outcom
greec
confid
30th
czechoslovak
jiri
conscienc
crimin
harsh
district
reform
rash
mark
few
much
jaroslav
jeopardi
gustav
kurdish
czechoslovakia
fadil
iraq
ller
third
pragu
dubcek
m
repay
mainten
occas
husak
sabata
kurd
319
bata
equatori
dahomey
inflict
spanish
80
coloni
mathieu
europ
guinea
44
suicid
edmundo
ren
exercis
atroc
nguema
coton
halt
vicepresid
kerek
gain
equatorian
emil
macia
brother
portion
shoot
use
tourist
illtreat
superintend
patrick
trotter
qualiti
becaus
indi
doubt
guilt
west
desmond
john
mnd
dominica
man
san
climat
vote
mral
manner
balagu
prevail
1966
joaquin
valid
suspect
tme
largest
reelect
function
especi
reflect
framework
macori
congratul
peripher
dominican
vicin
alia
amid
inter
vulgar
abolish
uncondit
30day
pend
newspap
galarza
72
martinez
jurid
itself
estabhsh
corrupt
lisandro
affih
mayor
languag
null
cooper
clip
rather
terrorist
ordinari
territori
petroleum
insult
qualif
lara
quash
role
betray
7
1970
upheld
neither
eight
exmemb
ecuador
quintero
justicia
codefend
especial
quito
conclud
void
lodg
school
imparti
secondari
heard
train
understand
activist
71
evil
ecuadorian
guayaquil
airplan
must
appoint
tribunal
none
havana
robberi
reopen
rodriquez
colombian
jaim
garcia
airport
moreno
prosecutor
hand
1969
hijack
socialist
se
litor
employe
imam
journahst
alexandria
egypt
cairo
secret
culmin
damag
spi
street
lyric
expect
negm
arab
anwar
mill
yuksel
spark
weaken
cotton
acquit
sympath
worsen
abdul
latter
song
pamphlet
academi
octobernovemb
yet
realign
attack
tape
factor
128
fouad
gamal
factori
quickli
textil
door
distribut
egyptian
award
resent
blame
98
inflat
127
adjourn
sing
surgeon
nineteen
teacher
nonetheless
look
150
choic
stress
off
14
consist
197273
nasser
antigovern
budget
separ
sadat
leftwing
era
abov
frustrat
exemplari
kobra
fact
provok
warfar
menelik
fair
ethiopian
hail
guard
session
permiss
plight
secessionist
diplomat
dergu
spoke
northern
45
180
send
selassi
cell
ethiopia
palac
chairman
forward
complic
memoir
addi
remaind
assumpt
aman
confidenti
bear
promulg
headquart
scrutini
eritrea
appropri
59
servant
depos
humanitarian
ababa
registrar
opinion
humphrey
emperor
upsurg
baadermeinhof
readi
con
paper
112
proper
paul
asylum
pretrial
objector
multipl
compar
smu
disquiet
favour
uniform
better
reverend
jit
exampl
comprehens
bitter
red
himself
germani
determin
insid
faction
presenc
minimum
tinu
solut
break
eritrean
conscienti
background
ling
socal
deadlock
reluct
justifi
adjust
mediat
pacifist
nder
my
wear
desta
discont
mental
flow
rank
fail
polynesia
mainli
lime
awar
val
nuclear
ry
test
conscript
french
ago
great
ill
oversea
manifest
soldier
giscard
steadi
frenchspeak
bongo
gabon
omar
gdr
ii
syrian
karl
solitari
friedrich
25th
confin
emigr
alan
contravent
watson
126
cottbu
susan
reason
jehovah
guis
heavi
see
wit
113
beyond
mobil
your
therefor
discontinu
constantin
stelio
350
96
chapter
nestor
age
karamanli
constantino
gunshot
via
mutil
135
prelud
laugerud
agent
incid
endem
escuintla
style
unsuccess
kjell
eleven
station
prensa
th
cite
guatemalan
play
copi
parliamentarian
overal
121
guatemala
cut
73
libr
relev
kidnapp
ident
car
alon
annot
item
threat
enclos
purpos
pohtic
daili
sensit
firm
preclud
scale
chain
canada
do
longer
canadian
media
henc
exdirector
aliv
farmer
threaten
jean
ever
bank
onward
unclear
onc
beforehand
kong
89
go
hong
caught
misdemeanour
lord
chines
altern
genuin
hardship
screen
ascertain
assert
china
care
clearinghous
repubuc
entri
permit
readopt
difficulti
sergio
augment
hungari
defector
persever
uncommon
next
rd
instruct
itali
michel
odon
jozsef
offend
exclud
italian
classif
enlarg
fetter
challeng
india
naxalit
extremist
1956
trid
entitl
insuffici
revis
narayan
marxist
contest
46
indira
sankar
sometim
bengal
indian
recommend
pakistani
devis
ray
contribut
risen
far
609
editori
overcrowd
react
disobedi
membership
fc
mahmood
iftikar
hygien
91
90
kista
bigger
short
bar
hindustan
k
page
88
bihar
chief
marxistleninist
gandhi
inadequ
remov
commonli
usual
ali
218
asian
suharto
children
nearer
slow
passag
less
late
certainli
nowban
regrett
meant
indonesian
australia
get
discreet
highlevel
ilsung
leonor
55
reconcil
ryan
bad
statist
marri
e
dimens
neil
often
orphan
sedillot
fold
rate
wenhsien
peter
reduct
transport
richard
away
abl
noninvolv
spokesman
dutch
suppress
lameda
korea
buru
heroin
gilmor
huang
siregar
expiri
garrison
annual
everyon
unpaid
admit
unabl
implement
compil
ci
desper
famou
arriv
obstacl
done
subcategori
revolut
mere
ultim
intergovernment
northsouth
respond
kartini
540
expand
similarli
poet
australian
venezuelan
disagr
nonexist
goverrmi
prosecutorgener
conson
cope
emphas
700
translat
essenti
93
92
94
contrari
virtual
employ
defin
10th
peke
serfdom
real
underestim
north
moreov
consortium
classifi
1963
commemor
command
korean
baum
stand
repeat
nimib
victoria
jacqu
kim
wive
phase
averag
renam
jakarta
indonesia
thought
pervad
reeduc
unchang
gone
shot
credibl
270
114
stillborn
239
salehi
aladopt
teheran
cross
iraqi
zia
shah
inadequaci
begin
woman
iran
greater
fire
shokrollah
babi
evin
102
129
herself
pregnant
iranian
iraniraq
zakho
hurl
endang
darwish
goug
130
mosul
ratifi
deed
rebellion
elderli
conspiratori
mulla
1949
eye
untru
englishman
pledg
unknown
inim
mason
senior
nonkurdish
economi
abu
circl
ire
akram
we
invite
freemasonri
bakr
200250
ourselv
embark
leadership
arous
reactionari
shua
solemnli
unremit
1958
box
kirkuk
domin
alarm
hostil
courtsth
baghdad
imperi
wing
chais
dinner
blockad
551
coven
summari
prohibit
attorney
yitzhak
ir
lebanon
132
131
en
palestin
aspect
administ
occupi
jew
termin
threeman
aloud
isra
rabin
alta
scandinavian
prohib
rami
similariy
syria
think
houphouetboigni
tiie
marieclair
1964
picard
beaten
felix
coast
gagnoa
ivori
southwestern
otherwis
complain
highli
jamaican
jamaica
mario
florizel
glasspol
though
repriev
apphcabl
baker
shall
governor
youth
hector
below
paragraph
liabl
heavier
privi
tyrel
ambassador
alrifai
palestinian
zaid
rabat
free
grate
jordanian
bureau
saleh
sanction
plo
jordan
hussein
exactli
summit
kenya
kpu
ix
purchas
ndon
lesotho
mapetla
withdrawn
170
basutoland
van
maseru
9
sedit
jonathan
treason
fund
niekerk
natal
mitig
fifteen
leabua
histori
harass
t
contain
barend
weigh
bcp
trotskyist
libyan
libya
1215
moslem
tripoli
countermand
300400
schedul
dispatch
chaig
60
abort
light
colonel
malagasi
crush
ratsimandrava
gill
dissolv
madagascar
47
rebel
philibert
plung
ahead
gabriel
pay
outskirt
mikuyu
banda
remand
thousand
chichiri
unconfirm
blantyr
lilongw
near
speech
diet
kamuzu
hast
holiday
zomba
malawi
european
sharp
primarili
decem
malaysia
62
begun
largescal
tan
81
perak
campus
besid
adjoin
kamunt
whatev
sarawak
poverti
seremban
sabah
candid
meantim
lumpur
lectur
97
squatter
neighbour
search
unlaw
sri
muhammad
kuala
malaya
shafi
bond
conseil
ration
concert
lib
sixth
moussa
referendum
traor
leas
militair
keita
modibo
mali
bamako
presum
cmln
malien
ri
beyla
mauritania
mauritanian
nouakchott
leaflet
mozambiqu
tanzania
frelimo
samora
unifi
machel
seen
attest
declin
wall
scratch
forbidden
windhoek
trivial
select
mandat
pattern
washingtonbas
waldheim
storm
terror
swapo
inhabit
mid1974
seri
withdraw
zambia
thoma
josef
joint
appel
half
cedric
ovamboland
slogan
namibia
ovambo
kurt
tens
flog
perpetr
exodu
namibian
intimid
openli
mexican
acknowledg
ca
nonviol
rodley
design
sinaloa
visibl
nigel
systemat
hilario
facto
futur
advis
scope
contrast
attribut
65year
autonom
beat
rner
75
drown
deepli
dirk
milit
shortterm
pertain
narcot
tini
arraign
disregard
tht
casablanca
national
moroccan
sahara
uniti
hide
build
branch
marrakesh
absentia
rapproch
good
appreci
intensifi
birthday
populair
philosophi
spain
faith
unfp
kenitra
morocco
courag
raja
ram
horn
koirala
nowdefunct
birendra
prasad
check
auspic
insofar
nepal
401
singh
147
140
206
director
exforeign
shaha
bahadur
welfar
nepali
shrestha
p
ratna
bhandari
nepales
antist
netherland
kee
resuh
atlant
nato
exempt
treati
hostag
76
somoza
suspens
corp
anastasio
nicaraguan
nicaragua
rien
kountch
just
progressist
hamani
expresid
nig
pupil
seyni
diori
niger
wage
gowon
nigerian
1976
yakubu
51
unrest
retract
nigeria
strong
impend
biafran
wahab
el
william
nassir
murad
sir
oman
omani
qabu
133
vicechairman
bahraini
saud
osmond
repeal
peshawar
bomb
nap
ordin
firmli
61
explos
upsid
bhutto
pod
moham
khair
eros
khan
frontier
bizenjo
injuri
retroact
laid
threeday
autonomi
camera
mairaj
baksh
baluchistan
mengal
complaint
immun
chilli
substanc
zulfikar
abus
burden
insert
karachi
fourteen
departur
machineri
counter
99
objection
prejudici
sixmonthli
wider
pouc
routin
liga
ttie
paraguay
christianori
villag
agrarian
unpreced
regist
innoc
anachronist
stroessner
today
wherebi
hit
secreci
inspect
clampdown
paraguayan
safeti
caraca
77
agraria
hierarchi
unlik
surround
benefit
socioeconom
alfredo
intervent
800
fiat
azazi
tawfiq
barrist
plattsmil
rubia
mortim
mansura
fragmentari
katrina
aden
yemen
salem
welltreat
founder
newlyappoint
autobiograph
mine
attitud
famin
anger
87
speak
northeast
appeas
gerd
reformthroughlabour
scienc
applic
product
defici
farm
kwangtung
convinc
monstrou
railroad
lower
counterrevolutionari
level
ruowang
welt
kinsman
bao
whole
spend
alvarado
edgardo
peruvian
deliv
unico
sindicato
laura
pip
denunci
radic
japan
inspector
lima
nongovernment
guardia
pino
vicent
la
broad
educaci
confederaci
implic
gainst
contraven
andahuayla
pena
pe
richter
pipelin
oil
velasco
peru
extend
affili
campesina
prada
resign
pedro
jarrin
mercado
derog
78
cajamarca
h
sutep
caller
focu
contract
financ
del
publicli
trabajador
proalbanian
widerang
charact
kazimierz
bafia
jerzi
polish
margin
poland
delinqu
mfa
pide
lisbon
overthrew
portuges
gome
businessmen
200
wealthi
partido
bo
aftercar
oust
discourag
maoist
antonio
marcelo
collect
proletariado
banker
compris
bourguet
supplementari
dizzi
premier
kaishek
sleep
taiwan
suffer
hsieh
tao
built
taiwanes
nationwid
trembl
happi
sensat
lu
type
threetier
channel
qualifi
lee
seymour
burn
here
water
blood
numb
chingkuo
tsungmin
a1
su
hospit
chiang
psycholog
anticip
fals
num
us
congression
wonju
engin
fabric
chiha
af
inhuman
pedersen
prais
brian
daniel
anyon
tactic
butler
wrobel
subcommitte
danish
hinder
chunghe
203
takeov
park
pubhc
deplor
reinvok
missionari
behaviour
harrass
168
barbar
honorari
95
rescind
retrial
suffici
furthermor
read
54
outlaw
53
invok
julyaugust
verdict
english
ber
prp
concept
rest
vietnames
saigon
monitor
chosen
dispers
spread
reveal
aprilmay
tra
corpor
tran
renounc
soar
exceed
crown
nun
higherrank
118
thieu
supervis
televis
discharg
huynh
drawn
signatori
spartan
team
montagnard
105
broken
33
guarantor
pictur
confisc
perhap
hiep
highland
hanoi
unobserv
boat
paint
chi
tackl
frontlin
reclassif
petti
draft
forthcom
tearga
nguyen
noncommiss
sanguinetti
outlin
propaganda
prg
phat
explor
highrank
236
quot
cleanup
varieti
collaps
broadcast
w
track
temporari
desert
danang
overtaken
hoa
depth
vietnam
fresh
sa
oppress
propos
oper
sithol
clinton
engag
anc
smith
northeastern
friction
protract
hurriedli
mandatori
ruthlessli
prostitut
umbrella
250
agre
equit
edson
lusaka
muzorewa
ian
captur
character
messag
settlement
blatant
ceasefir
negoti
sham
breakdown
swedish
desir
rhodesia
preliminari
stop
abel
argu
closur
zanu
meaning
clarif
salisburi
western
nationalist
1959
white
guerilla
partcip
bamberg
recruit
redetain
stimul
ceas
ndabaningi
bucharest
romania
ted
115
116
ceausescu
nicola
best
hungarian
coupl
divid
romanian
pentecost
outstand
folk
passport
homosexu
bibl
parent
seventh
prisoner
abroad
adventist
roughli
musicologist
zoltan
vasil
instruc
ibn
36
khalid
delight
arabia
faisal
saudi
aziz
abia
seneg
struggl
senegales
savan
demograph
udp
taylor
midnovemb
kamara
ampli
siaka
leon
wake
steven
sierra
apc
freetown
malayan
cane
sabha
trend
meter
strap
stroke
thondup
poh
skin
thick
scar
kuan
yew
nake
quit
palden
monarchi
lok
centimet
loyal
construct
pad
split
101
underground
speciallytrain
reviv
sin
inclus
accident
namgyal
buttock
princess
sikkim
antisept
22nd
4050
spine
tast
revers
incomplet
singapor
cruel
protector
sikkimes
barr
rant
exploit
claus
fine
re
disun
ting
religion
siad
somalia
somali
egal
ibrahim
aueg
fl
denounc
mount
equal
subvert
mogadishu
selfreli
fischer
cancer
diminut
thereaft
vorster
knowledg
winni
chronic
thirteen
uncharg
crowd
start
foster
restrain
notori
interraci
defianc
nelson
mandela
robben
durban
riotou
ralli
assault
bpc
wife
apartheid
conscious
profrelimo
saso
pretoria
juhan
450
madrid
deep
comision
duti
jimenez
carlo
franco
unresolv
blanco
forest
obrera
carabanchel
patriot
fairli
regular
antifascist
holi
drastic
postpon
neve
900
clandestin
genoveva
stasi
navarro
illicit
jo
admir
nonpolit
swiss
basqu
hearsay
jeopard
192
391
colombo
15day
sirimavo
happen
onu
discrimin
lanka
jvp
insurg
blomcoop
suspicion
vimukthi
verifi
insurrect
splinter
143
kandi
rise
kind
exclus
yvonn
103
tamil
inadmiss
shift
peramuna
janatha
loui
magazin
bandaranaik
abandon
brutauti
shave
charter
spectrum
proven
sudanes
umma
kassala
port
techniqu
sudan
overcom
decad
tradit
khartoum
obeid
sociaust
omdurman
kober
fasher
56
ideolog
intermitt
bed
koran
legallyrecogn
unhcr
nnlc
shang
ngwane
swaziland
v
liberatori
sergei
celal
weekli
rudenko
worship
switzeriand
545
handcuf
mail
disciplin
mykola
120
lighter
valentyn
incept
malnutrit
scholar
mathematician
latvia
switzerland
policemen
vladimir
yugoslavia
sponsor
distributor
119
eman
chronicl
141
mikhail
armenian
mamak
marchenko
misappropri
length
assign
malpractic
regardless
vin
georgi
ussr
demir
hammarberg
lone
fast
internationaladopt
vigour
editor
apph
tverdokhlebov
moscow
mistreat
pastor
andrei
sevket
baptist
kazan
defam
properti
dissemin
propag
nikolai
ann
firstev
incom
anatoli
aydinlik
moroz
invalid
kovalyov
burley
undertook
leonid
lithuanian
badli
rigor
ankara
psychiatri
overwork
neglect
mother
acceler
elia
rob
inspir
feet
stringenc
baath
134
hafez
girl
verac
belt
acquir
swed
amount
joseph
kilomet
persuas
beirut
limp
katri
albert
assad
eas
curfew
pact
proiraqi
marwan
atassi
damascu
mezz
feud
nissim
degre
inboth
certainti
mwanza
ambival
jumb
kambona
crop
nasreen
smuggler
plead
curious
juliu
speed
zanzibar
tanga
tabora
clove
offshor
pemba
tanzanian
karum
oscar
stem
babu
dar
salaam
cabinet
successor
zanzibari
nyerer
denmark
selfimpos
cash
abeid
aboud
persian
absolut
musician
unanim
rivalri
bangkok
pop
interim
347
music
kukrit
thailand
pramoj
104
nhan
622
simpli
600
politick
57th
crame
benigno
fellow
aquino
stern
proport
ponc
psychiatrist
creep
manila
torr
brainwash
ferdinand
injustic
simpl
testifi
sim
marco
diokno
muchcritic
enril
variat
psychologist
armounc
addict
165
oliva
you
truli
phihppin
philippin
larger
job
alter
genit
survey
manuel
uncertainti
catchal
40day
togoles
lom
sixteen
bizert
58
desforg
tunisia
roumi
manouba
concess
othman
togo
tuni
moniqu
diffus
simultan
sohtari
202
reconstitut
michael
dismiss
tobago
suport
freita
x
trinidad
embezzl
sese
amin
uganda
eastern
emissari
seko
flout
politicallymotiv
host
spare
hill
concili
idi
ugandan
zair
stipul
moroto
massacr
irish
prompt
version
incit
indispens
roy
want
alfr
england
donaldson
pat
fiveday
amsterdam
maze
vital
ireland
aris
warrant
heijder
indepth
proviso
solicitor
122
incur
ira
belfast
republican
disaffect
chairmanship
unmistak
uk
jenkin
parker
charlott
counsellor
bound
resist
reddi
miscarriag
15yearold
thanksgiv
gerald
asid
hugh
carey
content
feel
1011
carolina
extraordinari
assauh
jr
ford
charl
judgment
79
197374
earl
arson
rectal
florida
sale
fewer
imcondit
recant
enjoy
acci
bordaberri
uruguay
exchang
winston
coalit
unsatisfactori
seregni
juez
ia
sport
viera
literari
marc
marra
marxistdomin
stadium
sharpen
journal
norm
25member
inabl
amplio
satisfactorili
exdeputi
eduardo
gau
knew
lanza
regularli
barrack
juri
therebi
prestigi
mln
grupo
arismendi
rodney
politician
dockwork
tupamaro
alcid
colleagu
roof
unsuit
frent
swear
montevideo
stori
rez
rebeuion
percentag
gil
venezuela
andr
saif
teenag
japanes
edit
hamdi
wahid
137
qassem
bloodless
qadi
sabotag
aini
muhsin
riiter
kosovo
excel
centuri
nonconformist
sphere
thinker
significantli
sad
pohc
tuzla
mihajlo
djurov
wartim
prosoviet
discriminatori
novi
threemonth
dalmatian
mihajlov
1945
cetnik
ljubljana
resolut
reestablish
pristina
barov
belgrad
cominformist
midfebruari
recal
prejud
zagreb
bosnian
672
frit
montenegro
shown
notic
unpublish
slovenia
123
124
broekmey
plea
zadar
particulariy
yugoslav
tighter
ruter
kovacev
persecut
foregon
admonish
antiyugoslav
gla
unorthodox
tito
849
markedli
dusan
codex
croatia
serbian
rival
peak
djuro
14th
partisan
croatian
mobutu
twentyon
kaunda
internationa
kenneth
preserv
chitepo
accordingli
herbert
zambian
instrument
incident
promot
diplomaci
racial
copper
outlook
156
16year
upris
clinic
spa
expos
uptod
ringlead
strengthen
51976
implant
197
materialist
anticommunist
prerequisit
shkoder
scientif
frequenc
militia
minut
semioffici
network
moudjahid
princi
19751976
acquitt
neto
closer
sporad
disintegr
longtim
197576
gentil
nakuru
agostinho
viana
anywher
joaquim
andrad
accomplish
luanda
outbreak
diogen
necessarili
mercenari
promaoist
shop
ferreira
dynamit
parana
derecho
allianc
roja
steelwork
lo
labor
concret
brigada
ruiz
opt
parcel
seguridad
horror
videla
broadli
township
twomonth
pst
escuela
hipolito
aldun
riddl
enriquez
dramat
elaps
unlimit
digniti
river
raimundo
impun
bueno
villa
navi
isabel
reserv
86
astillero
captain
alianza
god
twoweek
havoc
communiqu
barredo
gutierrez
zelmar
notabl
quell
entir
solari
swift
ora
jorg
remark
speedi
olga
conti
moment
fernandez
freeli
anticomunista
profess
coordinaci
convalesc
key
blown
por
socialista
sack
investigacion
mero
firearm
haroldo
michelini
paralyz
estado
trabajo
mariano
reassur
forestal
sister
specifi
partli
adult
moder
compani
eat
humano
regimen
aaa
retaliatori
rosario
justicialista
fico
gloria
kilometr
rodriguez
salta
unconstitut
movimiento
azul
sell
huge
inevit
sociologist
revolucionaria
field
italo
destroy
lenient
mir
mayo
antiguerrilla
printer
combat
whitelaw
emilio
regina
21yearold
uni
461
extermin
typic
femal
vica
tucuman
escal
bullet
campo
rafael
izquierda
practis
commentari
businessman
ensenada
samir
mahalla
compens
commend
damietta
basili
alkhalifa
dissolut
fix
proclam
182
mustapha
181
khalaf
marhoun
kubra
sinai
hadi
ugur
musa
shahin
384
1952
nasr
nasserist
saeed
disengag
salah
ati
isa
amir
retir
zainal
interservic
rab
regret
gime
samajtantrik
tee
765
le
wealth
misus
bangladeshi
abdur
closest
jalil
countercoup
safe
modest
mushtaqu
substant
guaran
mohammad
mond
1977
lieuten
mansur
disband
novo
porto
apithi
justin
plotter
ahomadegb
transform
adulteri
gigant
uncov
hubert
maga
angri
benin
transmit
blane
andrew
unfortun
guevara
ch
twentyseven
inti
chao
signific
oruro
tranquil
cat
manacl
presencia
conspir
mirna
graviti
twentyfour
pereda
boliviana
contradict
peredo
cob
coco
seraf
codi
tavar
manoel
equip
queiroz
overrul
incap
jailer
councillor
pcb
celio
appal
sanitari
repr
brasileiro
execution
voluntarili
maciel
recif
bahia
pleas
parol
temporarili
bore
arn
dialogu
promoscow
tantamount
behind
melo
pernambuco
slight
sophist
departamento
240
santa
santo
interna
700800
militar
tenuou
incrimin
comando
filho
typist
almeida
herzog
sergip
catarina
coercion
cathedr
florianopoli
memori
doubl
fought
low
davila
recount
categor
rebuff
roberto
defer
evalu
modern
dura
elicit
borja
ie
cardin
santana
defesa
conceicao
sure
teodosio
driver
selfappoint
decompress
goia
miranda
progovern
doi
metal
32nd
curitiba
rakyat
partai
assimil
157
spring
macedonian
cultur
libertarian
chamurliski
stefanov
danub
speciou
280
balvan
southwest
christo
clerk
380
trnovo
1950
pomak
confeder
abovement
belen
kolev
anarchist
tin
maung
213
ehrenstr
jeanbedel
bangui
20year
bokassa
seventeen
comit
ois
coverag
fens
lix
tenu
mid1975
fran
politiqu
pair
malloum
wadal
f
brusselsbas
pour
tchadien
archaeologist
sheila
menes
notifi
comrad
intensif
pro
valparaiso
argument
252
0006
diseas
concepci
churchmen
element
fortyfour
jose
talcahuano
advantag
tuberculosi
ratif
inmat
ra
humili
504
163
sworn
187
analysi
santiago
vergara
astorga
substandard
downward
purg
strictli
epidem
laymen
vicaria
visa
ecumen
disappoint
raul
solidaridad
160
institution
marin
fach
naval
lost
zalaquett
drop
henriquez
34
alamo
padilla
araujo
municip
bull
landhold
bim
sucr
ordonez
unprotect
campesino
ring
cafe
rinc
gorgona
rey
esti
newli
sincelejo
ricardo
alway
sunday
mate
diaz
quiroga
curtail
jacobo
bogot
mar
therapi
cordoba
unauthor
mendez
institucion
anuc
arturo
fingerprint
gregorio
quinon
duqu
asociaci
henri
peasantri
disqualifi
fernando
ramirez
usuario
genaro
pereira
heriberto
audienc
marien
csc
anatol
topic
tour
congo
commanderinchief
congoles
brigad
ambrois
ngouabi
lope
encount
angel
0005
visitor
absente
elig
1st
cubano
boniato
imagin
agrupaci
currenc
franciscan
pursu
5th
comfort
cato
specul
monthli
divers
inviol
legitim
twothird
dissoci
spell
mutual
theori
uniformli
pueblo
darken
forum
vice
morri
conceal
token
miguel
indoctrin
penetr
occasion
vagu
disapprov
158
greekcypriot
turkishcypriot
osman
cssr
atmospher
159
theolog
strain
milan
scientist
nurs
fifth
mildest
comeniu
frg
milieu
jan
attach
recoveri
15th
disord
monotoni
faculti
diploma
warn
alexand
frantisek
silesian
medica
antonin
wors
forbid
kampuchea
clearli
138
sari
1718
samphan
lanuari
visavi
guardian
enquiri
penn
sisowath
kor
non
khieu
fell
battambang
heap
roug
arak
soum
yeng
presidium
bak
unansw
luu
yen
imperialist
band
pen
antirevolutionari
reiter
julio
washington
claudio
rican
soto
dominicana
suppos
jone
puerto
mpd
horacio
reschedul
dc
vald
roundup
nucleu
sampson
envoy
vasquez
montalvo
slander
amazon
conserv
guillermo
trujillo
buy
molina
shantytown
planck
parapolit
ambul
parapolic
highway
mauricio
orden
max
downtown
conciliaci
parallel
madlen
salvadorean
infrequ
dossier
credit
bridg
trap
elev
carballo
111
mcclintock
cocoa
guinean
muni
dictatorship
indiscrimin
ela
totalitarian
migrant
malabo
plantat
round
bant
restructur
arnt
meyerli
akaki
advent
capac
st
norwegian
teferi
stephani
gallen
preval
widow
expuls
mustafa
karlheinz
elisabeth
underscor
cologn
courtroom
maitr
herr
nordrheinwestfalen
162
yurtda
roth
client
turk
omer
cour
co
cassat
refu
demor
ret
dual
callup
letat
breton
tribunaux
17yearold
autonomist
ewe
bernard
various
bruno
tom
advoc
elli
tpfa
fou
antimilitarist
satisfi
ventur
sant
insubordin
dob
remi
jeanloui
y
2year
gabones
librevil
heart
harm
eyesight
impair
born
erika
unhygien
1944
reunit
signatur
wolfgang
wouldb
oftheir
161
segreg
greatest
ghana
abet
sheet
kofi
mensah
redempt
awoonor
accra
circuit
5year
sexual
ghanaian
count
stephanaki
athen
remiss
reimprison
demolish
gairi
jewel
deliber
grenada
carmelo
heavili
dynasti
accur
abducte
government
likewis
jack
belgium
characterist
vast
anteced
transvers
dealt
presidentforlif
sebastian
orozco
portauprinc
smallhold
byron
macout
whip
voluntari
pauciti
leg
whereupon
corr
inher
tenant
quich
reappear
omit
oa
mortal
toma
starvat
ot
block
effici
624
captor
limb
baltazar
market
255
ortiz
agricultur
chr
casework
valdemar
para
36th
legro
stick
thai
highest
claud
duvali
alix
felip
pin
demn
lock
landless
file
perez
pond
ransom
syndicat
differenti
authorti
di
neighbourhood
tie
extraleg
tien
vidual
unidentifi
pierreloui
conakri
boiro
108
kindia
pierr
juticalpa
olancho
reliant
tegucigalpa
cropland
redistribut
savag
subsist
hondura
strip
owner
honduran
counteract
penitenciari
squat
zone
nc
ing
enriqu
estat
chinchilla
alberto
landown
jerom
banana
specialist
middleag
unus
cultiv
hurrican
million
buri
bulldoz
spoil
drought
wealthiest
bystand
ma
oi
zelaya
countrysid
undershort
ranch
resolv
nearbi
devast
unc
landlord
betancourt
cattl
melgar
subordin
jozef
persev
andra
hate
allahabad
uphold
tyler
prakash
mehta
pure
asoka
disclos
voic
misa
nadu
bonu
irrespect
chandra
verif
hung
bona
candl
conform
ailment
admiss
sum
charan
conced
abscond
chavan
unfound
om
withdrew
scrutin
elector
disclosur
maharashtra
chanc
revoc
jaya
39th
175
bombay
anticorrupt
desai
wield
mari
insanitari
strict
treat
morarji
40th
legislatur
gore
rajya
226
tihar
bharatiya
tinder
iron
38th
satyagraha
worri
jamshedpur
despot
attract
kidney
veteran
mahatma
democraci
fide
authoritarian
pradesh
statesman
12month
fakhruddin
liver
horrifi
136
earth
pki
ambar
selfdef
headman
seluruh
stein
rejoin
distort
cook
redesign
hunt
easili
meal
barisan
sew
deduct
uniqu
11th
bti
intermin
goe
secretli
309
sukarno
oei
gerakan
java
valu
panel
hien
trader
ritual
penuri
love
loan
buruh
dowd
breadwinn
newslett
moluccan
stretch
yap
dreg
harsono
boil
flaw
750
unend
insan
heighten
tani
tree
soul
stall
745
thiam
captiv
nippl
predica
contempt
rubber
till
book
rememb
rupiah
firsthand
drift
whi
tanaka
payment
480
organisasi
sentral
incorpor
bribe
267
bulletin
medicin
mahmoud
85yearold
maxim
perfor
lune
savak
mehdi
gorki
outspoken
ayatollah
eardrum
183
montazeri
abba
pahlavi
65yearold
injur
mohsen
11year
outset
najaf
26yearold
circumv
kurdistan
bayonet
550
karbala
khaliq
kdp
rough
knu
ghafour
1948
faulti
raouf
tend
barzani
186
184
185
extradit
midmarch
196869
rcc
talabani
shia
dwindl
nasir
sattar
sheer
aforesaid
stab
38yearold
overt
freemason
hammadi
39
male
pilgrim
affirm
pesh
indirectli
merga
suleimaniya
quarter
sunnidomin
jalal
aharon
haifa
pere
khatib
4year
vacat
haim
enemi
barak
shawki
shimon
8year
fatah
centuriesold
shorter
liborio
gaeta
pdci
lucien
divoir
13th
twelv
te
mocratiqu
twohour
lloyd
amman
leather
pollut
drink
nowar
understood
wrong
maan
israelioccupi
188
salt
renown
lethal
reconvict
kanu
achieng
speaker
mutai
285
shikuku
kenyan
bu
kenyatta
kariuki
along
robber
sijeyo
experienc
12th
wasonga
detractor
jomo
seroney
reintroduc
nairobi
chelagat
aros
redetent
thirtyseven
gerard
60day
kolisang
bashir
creation
demon
190
muammar
toumi
taher
farag
sherif
dissatisfact
strate
189
benghazi
statut
muftah
amer
cleans
gaddafi
error
genera
didier
infract
ratsiraka
capacit
northwestern
155
dzeleka
seldom
sect
mind
theoret
amnest
poo
settl
sick
listen
across
mcp
typifi
gajah
detentio
ee
resum
datuk
sweep
seat
batu
chin
liam
juliet
noor
snap
sociolog
mansor
certifi
enact
pose
discretionari
sosiali
hie
sy
anthropolog
malaysian
wong
invest
onto
sissoko
otal
diffcult
automat
stringent
mujer
weight
rcel
lawenforc
statutori
doctrin
ojeda
quer
compli
marta
tlatelolco
taro
realiti
load
kebir
festiv
benjelloun
luxembourg
kesh
usfp
juge
hoss
dinstruct
fiftyf
railway
marqu
mutini
maputo
lourengo
metr
swakopmund
distanc
caprivi
empow
kilo
indirect
hendrik
okahandja
leak
reuben
narrowli
aaron
otto
dakar
axel
depopul
nkandi
duress
shikongo
ankl
foremost
grootfontein
filemon
macbrid
sean
tribal
johann
david
elifa
kavango
bantustan
krishna
31st
revok
tulsi
thapa
yagya
sher
bhattarai
endors
oni
nave
efficaci
penitentiari
perturb
fractur
guzman
armypolic
luna
lung
ez
rene
uncheck
sandinista
concen
brunt
28yearold
oficina
counterinsurg
immers
matagalpa
investiga
liberaci
tipitapa
vastli
paid
asa
modelo
tration
tellez
prudent
107
nueva
debayl
clergi
underw
fsln
corral
fli
managua
segovia
tion
wrongli
tillaberi
edg
bakari
nguigmi
agad
bilma
sidi
eighteen
bayer
sido
zinder
sani
djibo
sawaba
obasanjo
1979
kampala
olusegun
modifi
thorough
murtala
merci
brigadi
125
toler
prerog
disrupt
lago
receipt
majesti
consult
ghulam
tariq
hyderabad
wali
akhtar
customari
envisag
urdu
279
qureshi
terlingen
digest
bearer
idea
khuzdar
sit
ghaffar
sovereignti
pronounc
resort
add
yahya
sindhi
beard
144
145
patient
ijaz
sindh
hussain
ashraf
hashim
disqualif
quetta
zahur
gambl
elahi
altaf
pull
dpr
miimtaz
sardar
malik
keen
aslam
sibi
bakhtiar
338
jailor
vigilancia
asunci
149
mid1950
torment
delito
soler
scarc
option
lao
pathet
vientian
souphanouvong
rightist
side
194
193
ismail
yemeni
kalidi
fluctuat
airlin
feudal
nonjudici
atif
pdri
salim
arabian
holland
breach
formul
badr
flat
englishlanguag
nervou
pilot
gulf
textbook
bukhari
lessen
counti
dagger
indign
grade
wreath
militiamen
mild
fortnight
nonpubl
kuomintang
griffith
abid
poem
squar
bourgeoisi
reuter
tsetung
machin
shenyang
hero
hua
hai
devot
monument
tian
1954
notebook
flee
mao
deserv
guofeng
dream
histor
knive
enlai
chou
overton
liaon
cuadro
quesada
bermudez
montagn
metallurg
sepa
ledesma
unrestrict
cuenta
striker
lambayequ
aircraft
hernan
advisor
jungl
hern
wojciechowski
whoever
prescrib
kowalczyk
blacklist
271
accomplic
sejm
164
memoranda
adam
stanislaw
booksel
ordem
jointli
1867
tighten
smaller
wang
roc
1947
lesser
200300
senter
abrog
pai
yatsan
yuan
taipei
onethird
essay
chung
dae
broaden
ahn
quaker
ik
139
tai
agit
byung
kwan
hon
sun
suk
cho
donor
po
hahm
whch
presbyterian
seoul
buyong
surveil
jung
kwon
donga
prolifer
invas
yu
bread
oo
lament
fellowprison
theologian
unsupport
yun
reinstat
moon
lawenforce
151
fashion
exert
registr
midnight
152
puppet
reunion
ship
kontum
thiev
salvat
tho
nhat
thanh
evacu
redhand
repent
giai
retali
criteria
hoard
recept
chau
evangel
dung
ranger
phong
probationari
postal
accid
cong
binh
ke
invit
looter
instig
congreg
doc
truck
steal
weapon
joshua
fortifi
unilater
queen
16page
dispel
trust
poli
jeremiah
commenc
disillusion
detect
fenc
nkomo
mhlanga
rout
indemn
ministeri
hilari
sanit
elizabeth
suit
rail
miriam
bulawayobas
indemnifi
tical
waddington
udi
cage
waiv
canaan
encamp
remind
chirau
sizeabl
apprehend
caravan
camil
hildegard
jilava
konrad
willi
1946
soninlaw
notif
166
daughter
emin
romanianyugoslav
consular
explod
dismay
sequel
pademba
profound
tre
bi
lansana
senghor
leopold
road
tong
zahari
toon
rajah
tse
siew
strenuou
roundtheclock
aircondit
fatigu
ho
exdetaine
lim
cold
hock
satellit
sevenpoint
siyad
preoccup
rand
dean
corps
harold
kruger
burger
afrikaan
kaiser
johnni
raymond
drama
reinforc
transkei
duncan
mdluli
irv
johannesburg
grang
10member
steyn
postmortem
matanzima
pietermaritzburg
perjuri
cleopha
withhold
inquest
cosma
nusa
ndlovu
punctuat
hamilton
suttner
painter
nduli
mxeng
refut
howard
summon
herald
thing
vincent
incognito
antiapartheid
9year
patriota
terminolog
guip
separatist
alava
238
euzkadi
simo
toledano
ole
ignacio
aud
revolucionario
democr
supposedli
submerg
antifascista
papal
vizcaya
homeland
privaci
burgo
hoyo
ta
appendic
karlsruh
810
169
489
167
nuncio
goal
throne
garmendia
gobierno
overnight
bilbao
eta
manzanar
tica
cigarett
spaniard
shipyard
espa
zcoa
navarra
lakshman
slower
jaffna
welikada
titl
148
dia
hamper
ananda
sinhala
instal
mahara
399
librari
salih
lebanes
196
khalif
27yearold
brethren
subhi
predomin
mubarak
floor
nureddin
323
adjac
mahmud
zouheir
286
uthman
safi
ramadan
baathist
newlyadopt
adnan
shulak
hamra
diabet
omran
zuheir
jaafar
mitte
recaptur
underway
com
akobo
nene
zwane
swazi
ambros
phenia
jona
mat
johan
buch
eli
exig
noncombat
7month
jeanclaud
mann
serg
308
gray
mattaka
cast
asp
behav
685
indochina
seni
influx
offens
146
undesign
constabulari
mendoza
centr
defens
ramo
luzon
rebelli
bug
frank
bourguiba
widen
pell
tunisian
habib
nejib
ex
delirium
20th
diagnos
schizophren
samizdat
suleyman
fit
deterr
lithuania
ascrib
amelior
ukrain
mechan
ferit
authorship
gluzman
vilniu
mistrust
pyotr
feldman
dnepropetrovsk
revel
schizophrenia
melen
peacetim
gayrettep
incarcer
nonmed
daytoday
wholli
officiallyappoint
hooligan
yuri
forens
counterpart
mvd
let
semyon
electrician
disciplinari
tatar
stabl
174
173
171
unapprov
odessa
sort
flight
vyacheslav
yusuf
georgian
punit
sound
novel
problemsolv
anonym
antisoviet
prejudic
purportedli
diagnosi
rape
istanbul
rheumat
spokesmen
criterion
demirel
ukrainian
unwarr
unchalleng
lay
orderli
crimean
degrad
tbilisi
fed
remotest
stood
naguru
10year
discredit
troubl
tyrant
concoct
feed
malici
upper
981
thereof
allegi
217
177
176
unqualifi
369
middecemb
samuel
1934
dewind
wise
seduc
unaccept
adrian
controversi
edward
codif
carlson
wilbert
jess
donald
joanna
dakota
moynihan
deadli
freddi
norman
amicu
levi
california
oregon
birth
child
greatli
curia
fowler
modif
rumsfeld
denni
explan
semiasphyxi
cadr
colorado
nowaday
rightofcent
plu
obscur
alvaro
leftofcent
32yearold
newsweek
impact
massera
ratio
governmentcontrol
proscript
rapidli
650
lite
plate
618
amateur
unconvinc
undoubtedli
alarmingli
punto
submarin
asthma
bruis
tripl
tank
ruptur
populist
chamber
capita
ignor
balbi
ptj
ran
theatr
garc
83
3452
cnica
figueroa
romero
divisi
inteligencia
twenti
intelli
evaristo
forti
marcano
xxx
monaga
medina
teatro
22yearold
je
efra
cuartel
dim
disip
javier
pacheco
pica
guedez
genc
verbal
195
infiltr
husain
ethic
aggress
rada
yar
workshop
saboteur
someon
literaci
cousin
referr
embodi
accommod
hagu
curricula
citadel
sanaa
radovan
vidov
attain
stevanov
178
farsi
josip
brkic
tanjug
insurrectionari
acquaint
srdja
12page
sympathet
dragoljub
radulov
stomach
orthodox
booklet
mariu
franjo
berg
cinema
somewhat
disbar
stabil
inhibit
mirko
whenev
popov
annua
milovan
djura
ljubomir
stalinist
82
sev
twentysix
phenomenon
heaviest
richer
interparliamentari
daylight
cone
shumba
caribbean
autocrat
tongogara
tramp
contin
sur
perspect
analyz
elimin
resourc
poorer
967
democraticallyelect
josiah
workload
expatri
englishspeak
conceiv
technolog
stifl
edgar
mislead
calcul
livingston
unspecifi
apparatu
kuanda
afghanistan
zahir
daud
ti
boumedienn
houari
medea
soci
mac
housearrest
sixyear
oran
mercenar
wellpublic
19761977
rightli
dunem
nito
ro
urgenc
obrero
resistencia
roe
rice
au
gravest
sosa
fake
energi
devoto
estudiantil
atom
liabil
drinan
perla
robert
unab
discret
alvarez
gerardo
18yearold
546
margarita
cemeteri
tell
montonero
younger
outrag
plata
ezeiza
physicist
argentin
astound
plane
senor
duart
disprov
midjuli
unesco
undoubt
aveburi
blindfold
tucum
ximo
unacknowledg
hideout
erp
gatti
peronist
transpir
10day
mysteri
ninemonth
adriana
truth
santucho
unaccount
rdoba
ownereditor
shaikh
alcohol
nsi
jatiyo
distress
vi
vii
ziaur
ittefaq
canton
837
serajul
retri
737
muzaffar
gate
onefifth
gono
supervisori
secular
alam
bia
bengali
1978
oneparti
sc
vwth
harden
learnt
housetohous
sponsorship
invad
leamt
oau
benines
yvett
adjovi
scholarship
larri
bermuda
burrow
erskin
taxidriv
hood
viacha
siet
inject
febmari
comibol
lora
store
pain
seventi
minero
dark
dop
shaft
photograph
sr
pillar
cruz
si
pan
minework
fstmb
sindic
soweto
manama
facilit
schoolchildren
acrimoni
grosso
immin
lhomm
marginai
fleuri
droit
governorship
incompat
nov
er
angelo
fee
riberao
bonito
vagrant
nova
joao
aldo
busi
governmentback
got
bosco
worth
cancel
sil
destacamento
pomar
igua
insecur
brasileira
br
mato
cardoso
diminish
lav
metalwork
enshrin
arroyo
knock
dth
brasil
whilst
baixada
comunista
ventura
slo
democratica
chiefli
brasilia
dubiou
fluminens
joinet
bah
batista
burial
ohn
burmes
kyaw
mastermind
harbour
reckon
bmnei
insein
myint
bspp
mid1976
andonov
stonemason
zagora
alexandrov
sympathi
text
stara
illhealth
toulon
burga
symposium
asen
ljuben
marinov
nichola
stefan
19741975
19731974
vratsa
pleven
montpelli
undisclos
kondoferski
destruct
gynaecologist
architect
pension
midapril
vinica
plovdiv
progr
hutu
uprona
rwanda
micombero
et
bagaza
nkamb
mukong
bamenda
anglophon
antigovem
ron
honour
leonard
ridg
pine
peltier
fbi
followup
ceremoni
secretarygener
empir
tribesmen
imped
seizur
djarma
toubou
reliev
abakar
djibrin
idriss
frolinat
mahamat
vdth
navarret
constitu
zamorano
godoy
alejandro
disappearan
painstak
daughterinlaw
montealegr
cort
donoso
bernardo
desaparecido
sitio
pez
contrera
onofr
tr
castillo
eugenio
rivadeneira
cornejo
gonzalez
heman
araya
huber
leteli
incontrovert
weibel
galvez
elena
iv
zuleta
detenido
flore
concha
mu
mont
oz
distant
tional
garrido
procesado
bourgeoi
obviou
grievanc
revision
frame
francepress
antirightist
lin
label
unavail
179
mete
chen
art
ninth
flexibl
1900
bureaucrat
selfish
flower
pseudonym
yoi
headless
heavenli
shanghai
hsil
wo
vicepremi
poster
grain
afp
fukien
relationship
fascist
reveng
brand
preach
ye
wallpost
misde
wuhan
ching
1951
actress
nt
li
yiyang
24yearold
1955
singer
word
room
opera
homag
1957
authent
display
chop
enquir
piao
fault
behead
ll
gang
remedi
consejo
bogota
indigena
ramon
merit
tenur
overturn
fulfil
2123
soilih
comoro
mayott
comorian
ocean
stt
anjouan
ouesso
joachim
pascal
calm
yhombiopango
lissouba
brazzavil
alphons
alsina
vail
albertina
merced
caba
clara
amalia
teresa
fern
walter
bertha
mile
aguila
polo
sar
jargon
orient
lauro
menoyo
cid
eloy
lama
felicia
caridad
bustamant
z
az
cabana
sixti
lengthi
pa
seminar
plantado
fatal
amanec
rica
valladar
esther
cabrera
alonso
olivera
rangel
betterknown
arac
zoila
est
dora
reph
delgado
nobodi
nilda
combinado
nuevo
fort
undeni
piloto
georgina
nchez
grau
guillermina
ortega
alem
ndez
dolor
zara
barbara
magdalena
plzen
ale
ivana
playwright
zina
stoel
haemorrhag
nasta
aigner
vener
269
cerebr
sidon
rock
omest
javorski
manifesto
gynaecolog
starek
miroslav
lifestyl
244
entertain
241
243
242
sixandahalf
probat
jirou
telephon
karel
slovak
sixday
leder
historian
eightyon
pavel
licenc
pravo
ota
refrain
havel
kosic
karol
der
jelena
hungerstrik
vanek
halv
vaclav
competit
rude
goldman
knee
basketbal
agronomist
drive
encamaci
wdth
emmanuel
gusto
malfunct
shortcom
soriano
spuriou
healthi
pretext
interf
preacher
unad
riobamba
imprisormi
bolivar
inca
manriqu
hemispher
poveda
buse
subsidi
plant
fay
solidar
veto
chef
zaabal
countrywid
296
294
295
commod
opositora
farabundo
spoken
consecr
rit
reexamin
28th
madriz
rivera
plaincloth
salvadorian
acced
chancellor
excelsior
ensu
fraud
pollwatch
plaza
37
marti
extrajudici
uno
consul
dispens
resumpt
derg
chair
custody
hitherto
sympathis
rose
ravag
venom
bloc
selfdetermin
shipment
toll
supplier
mid1977
mengistu
dweller
209
congressman
mariam
liquid
rove
eprp
gr
civic
keller
ce
unfit
broader
rouen
pr
bell
1961
8yearold
guillotin
nord
marcellin
induct
publiqu
245
246
theft
mer
feloni
philosoph
hamida
dassis
sident
honeck
deliveri
reinhard
climax
leipzig
fuch
exerc
sea
ter
havemann
humboldt
turnov
manfr
strength
lia
burnt
brandenburg
unpredict
wilhelm
erich
oskar
warsaw
lutz
thirtyf
jazz
rgen
rudi
grund
highlight
coffe
247
undergradu
249
248
schr
georgio
songwrit
wolf
rainer
ernst
ein
bundestag
rttemberg
spiegel
vogel
consent
bookshop
share
vidoj
player
253
andrea
231
wittingli
interced
identif
fraction
bender
forg
irmgard
oberlandesgericht
stammheim
egon
88a
fruit
badenw
ulrik
hamburg
251
sex
bodili
129a
2nd
glorifi
cruelli
ingrid
reward
unnecessari
yendi
kojo
secess
focuss
remit
ignatiu
acheampong
miutari
volta
nsawam
fourandahalf
loannina
freelanc
exoner
chapman
arthriti
254
everyth
evangelo
hellen
toe
cotzal
ae
cardona
adolfo
17page
spars
osorio
maldonado
sudden
auditoria
dubon
partner
orant
pineda
peten
guerra
lt
nassar
ammunit
lobo
mihtari
paratroop
camino
negro
chart
consign
waldemar
leonel
napoleon
onesixth
don
8th
countersubvers
arana
deposit
deathsquad
blanca
ness
mano
semiperman
blind
toilet
antislaveri
usbas
alata
governmentsanct
tchidimbo
telli
diallo
pulpit
maim
onthespot
jeanpaul
subcommiss
underfeed
commonplac
malaria
heat
circumscrib
extort
exposur
burnham
policeman
forb
arnold
rampersaud
guyana
contradictori
heed
dieudonn
lachr
anumb
factual
christma
hacienda
sumario
reintroduct
portlaois
hatr
murray
258
sandor
shoe
256
257
szombath
clergyman
homicid
rudov
fitzgerald
kadar
jano
imr
noel
thoroughli
preparatori
premedit
antiterrorist
1939
offduti
unjustifi
budapest
nonjuri
necessit
dublin
vatican
expressli
friendship
activitist
unfavour
lawrenc
uttar
readili
rat
mohan
andhra
851
compat
indulg
marg
fernand
laps
754
lean
kerala
parikh
janata
femand
roll
630
crippl
trouser
lai
jasbir
44th
alist
446
rajan
vomit
386
calcutta
antin
roller
promptli
steel
903
645
swing
tinat
wooden
pole
madhya
pubhsh
swollen
warmli
293
threeyear
livestock
salemba
bum
shizuoka
realli
custom
akahori
accuraci
tropic
sixyearold
fukuda
icrc
